lab11_ci/ci4/app/Controllers/Api/Auth.php

    public function login()
    {
        $input    = $this->request->getJSON(true);
        $username = $input['username'] ?? $this->request->getVar('username');
        $password = $input['password'] ?? $this->request->getVar('password');

        $model = new UserModel();

        $user = $model->where('username', $username)
            ->orWhere('useremail', $username)
            ->first();
---
SELECT *
FROM `user`
WHERE `username` = 'admin@email.com'
OR `useremail` = 'admin@email.com'
 LIMIT 1