lab11_ci/ci4/app/Controllers/Post.php

INSERT INTO `artikel` (`judul`, `isi`) VALUES ('Mengenal Axios Interceptors', 'Axios Interceptors adalah fitur yang memungkinkan aplikasi mencegat setiap request dan response secara global sebelum diproses lebih lanjut.')
---
    public function create()
    {
        $model = new ArtikelModel();
        $data = [
            'judul' => $this->request->getVar('judul'),
            'isi'   => $this->request->getVar('isi'),
        ];
        $model->insert($data);

DELETE FROM `artikel`
WHERE `id` = '41'
AND `id` IN ('41')
DELETE FROM `artikel`
WHERE `id` IN ('41')
---
    public function delete($id = null)
    {
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->delete($id);
        if ($data) {
            $model->delete($id);