lab11_ci/ci4/app/Cells/ArtikelTerkini.php

    public function renderByKategori($kategori = 'teknologi')
    {
        $model = new ArtikelModel();
        $artikel = $model->where('kategori', $kategori)
                        ->orderBy('created_at', 'DESC')
                        ->limit(5)
                        ->findAll();
---
SELECT *
FROM `artikel`
WHERE `kategori` = 'teknologi'
ORDER BY `created_at` DESC
 LIMIT 5